// - Дано натуральное число n. Выведите все числа от 1 до n.
let outToN = n => {
    let i = 1;
    while (i <= n) {
        console.log(i);
        i++;
    }
};
outToN(13);
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
let fromAtoB = (a, b) => {
    if (a < b) {
        while (a <= b) {
            console.log(a);
            a++;
        }
    } else {
        while (b <= a) {
            console.log(b);
            b++;
        }
    }
};
fromAtoB(13, 3);
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
let swapToI = (arr, i) => {
    let [j] = arr[i];
    arr[i] = arr[i + 1];
    arr[i + 1] = arr[j];
    return arr;
};
swapToI([9, 8, 0, 4], 0);
// - Сворити функцію яка буде перенос ити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
let moveToEnd = arr => {
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] === 0) {
            arr.push(arr.splice(i, 1)[0]);
        }
    }
    return arr;
}
moveToEnd([1,0,6,0,3]);